Revit 2027 API
IlluminationFailures Properties
The BuiltInFailures.IlluminationFailures type exposes the following members.
Properties
Name | Description
IESFileNotFoundWarning |  Estimated Illumination failed. IES file not found for lighting fixture.
LightingFixtureLumensWarning |  Estimated Illumination failed. Lumens not set for lighting fixture.
RoomCoefficientUtilizationWarning |  Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.
RoomLightLossFactorWarning |  Estimated Illumination failed. Light Loss factor not set for lighting fixture.
Top
See Also
Reference
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace